In [1]:
# apply(), append(), concat()

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame({'id':[1,2,3,4,5],
                  'name':['A','B','C','D','E'],
                  'salary':[456,350,480,560,654]})

In [4]:
df

   id name  salary
0   1    A     456
1   2    B     350
2   3    C     480
3   4    D     560
4   5    E     654

In [5]:
def test(s):
    return s*s               # create a squre function

In [6]:
df['new_salary'] = df['salary'].apply(test)   # test function used with apply, it can be apply to all dataframe but it need to all integer

In [7]:
df

   id name  salary  new_salary
0   1    A     456      207936
1   2    B     350      122500
2   3    C     480      230400
3   4    D     560      313600
4   5    E     654      427716

In [8]:
df1 = pd.DataFrame({'id':[1,2,3],
                   'new_id':[2,4,6],
                   'sal':[45,65,98]})

In [9]:
df1

   id  new_id  sal
0   1       2   45
1   2       4   65
2   3       6   98

In [10]:
df1.apply(test)            # here test function used with apply to all dataframe

   id  new_id   sal
0   1       4  2025
1   4      16  4225
2   9      36  9604

In [11]:
df2 = pd.DataFrame({'city':['pune','aurangabad','mumbai','nashik'],
                   'sale_area':['nagpur','goa','kolkata','chennai']})

In [12]:
df2

         city sale_area
0        pune    nagpur
1  aurangabad       goa
2      mumbai   kolkata
3      nashik   chennai

In [13]:
# capital letter to all city

In [14]:
df2['city']=df2['city'].apply(lambda x:x.upper())

In [15]:
df2

         city sale_area
0        PUNE    nagpur
1  AURANGABAD       goa
2      MUMBAI   kolkata
3      NASHIK   chennai

In [16]:
df2['sale_area'] = df2['sale_area'].apply(lambda x:x.upper())

In [17]:
df2

         city sale_area
0        PUNE    NAGPUR
1  AURANGABAD       GOA
2      MUMBAI   KOLKATA
3      NASHIK   CHENNAI

In [18]:
df3 = pd.DataFrame({'Country':['India@','USA#','Canada$'],     # create dataframe with special characters
                   'City':['@mumbai','*pune','#Chennai']})

In [19]:
df3

   Country      City
0   India@   @mumbai
1     USA#     *pune
2  Canada$  #Chennai

In [20]:
import re

In [21]:
def clean(s):
    s = re.sub(r"[^a-zA-Z0-9]" ," ",s)     # create function for remove special character from dataframe with help of re
    return s

In [22]:
df3['Country'] = df3['Country'].apply(clean)     #apply clean function with apply

In [23]:
df3

   Country      City
0   India    @mumbai
1     USA      *pune
2  Canada   #Chennai

In [24]:
df3['City'] = df3['City'].apply(clean)

In [25]:
df3

   Country      City
0   India     mumbai
1     USA       pune
2  Canada    Chennai

In [26]:
df4 = pd.DataFrame({'Country':['PK','UK','US'],  
                   'City':['Lahore','England','Newyork']})

In [27]:
df4.append(df3,ignore_index=True)        # df3 append on df4

C:\Users\Roshan B\AppData\Local\Temp\ipykernel_18872\2754330054.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df4.append(df3,ignore_index=True)        # df3 append on df4

   Country      City
0       PK    Lahore
1       UK   England
2       US   Newyork
3   India     mumbai
4     USA       pune
5  Canada    Chennai

In [28]:
df3

   Country      City
0   India     mumbai
1     USA       pune
2  Canada    Chennai

In [29]:
df4

  Country     City
0      PK   Lahore
1      UK  England
2      US  Newyork

In [30]:
pd.concat([df3,df4],ignore_index = True)

   Country      City
0   India     mumbai
1     USA       pune
2  Canada    Chennai
3       PK    Lahore
4       UK   England
5       US   Newyork

In [31]:
pd.concat([df3,df4],axis=1)

   Country      City Country     City
0   India     mumbai      PK   Lahore
1     USA       pune      UK  England
2  Canada    Chennai      US  Newyork

In [32]:
df5 = pd.concat([df3,df4],axis=1)

In [33]:
df5

   Country      City Country     City
0   India     mumbai      PK   Lahore
1     USA       pune      UK  England
2  Canada    Chennai      US  Newyork

In [34]:
df6 = pd.DataFrame({'Population':[14500,65400,98523]})      # create new df6

In [35]:
df5

   Country      City Country     City
0   India     mumbai      PK   Lahore
1     USA       pune      UK  England
2  Canada    Chennai      US  Newyork

In [36]:
df6

   Population
0       14500
1       65400
2       98523

In [37]:
pd.concat([df5,df6],axis=1)      # concat df5 with df6

   Country      City Country     City  Population
0   India     mumbai      PK   Lahore       14500
1     USA       pune      UK  England       65400
2  Canada    Chennai      US  Newyork       98523

In [38]:
df6

   Population
0       14500
1       65400
2       98523